app/controllers/calendars_controller.rb

  def show
    handle_joomla
    Event.synchronize_upcoming_events
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
INSERT INTO "events" ("name", "location", "organization", "start", "description") VALUES (?, ?, ?, ?, ?)  [["name", "Gardening"], ["location", "San Francisco"], ["organization", "Nature in the City"], ["start", "2012-01-01 00:00:00.000000"], ["description", "Gardening at San Francisco"]]