app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 7]]
SELECT "guests".* FROM "guests" INNER JOIN "registrations" ON "guests"."id" = "registrations"."guest_id" WHERE "registrations"."event_id" = ? AND "guests"."is_anon" = 'f'  ORDER BY "guests"."first_name" ASC  [["event_id", 1]]
SELECT  "guests".* FROM "guests" WHERE "guests"."meetup_id" = ? LIMIT 1  [["meetup_id", "137622772"]]
---
  def show
    @message = flash[:notice]
    @event = Event.find params[:id]
    new_guests = @event.merge_meetup_rsvps
    @non_anon_guests_by_first_name = @event.guests.order(:first_name).where(is_anon: false)

    if new_guests.nil?
      # NOTE ANY LOCAL ONLY EVENT WILL SHOW WITH THIS MESSAGE.
      # That is OK, given that is happens only during testing
      # because in production, no event will be only local
      flash.now.notice = 'Could not merge the RSVP list for this event.'
    elsif new_guests.empty?
      flash.now.notice = "The RSVP list is synched with Meetup. #{@event.generate_participants_message}."
    else
      flash.now.notice = 'The RSVP list for this event has been updated.' \
        " #{new_guests.join(', ')} #{(new_guests.size > 1 ? "have" : "has")} joined." \
        " #{@event.generate_participants_message}."

INSERT INTO "events" ("name", "venue_name", "address_1", "city", "zip", "state", "country", "description", "how_to_find_us", "start", "end", "meetup_id", "updated", "url", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    result = Event.check_if_fields_valid(event_params)
    if !result[:value]
      flash[:notice] = result[:message]
      redirect_to new_event_path
      return
    end

    @event = Event.new(event_params)
    meetup = Meetup.new
    if remote_event = meetup.push_event(@event)
      @event.update_meetup_fields(remote_event)
      @event.save!

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    if !flash[:notice].is_a?(Array)
      @message = ""
    else
      @message = 'Please fill in the following fields before submitting: '
      flash[:notice].each do |key|
        @message += key + ", "
      end
    end
    @message = @message[0..@message.length-3]
    form_validation_msg
    @event = Event.find params[:id]