app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]
    # sign in or create new user
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) ||
        User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "token", "expires_at", "refresh_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? LIMIT 1  [["provider", "meetup"], ["uid", "184911456"]]